config/InformationRegisters/SAS_ДатыДвиженийДляВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>SAS_ДатыДвиженийДляВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АптекаКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/DWH_ДатыДвиженийДляВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>DWH_ДатыДвиженийДляВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АптекаКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/SAS_ДатыРасчетаПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>SAS_ДатыРасчетаПотребности</Name>
			<Comment>Шапки расчетов потребности, рассчитанной в SAS </Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКЗаказуSAS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаказаSAS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/CommonModules/SAS_Обмен/Ext/Module.bsl
Процедура ЗаписатьДатуИзменений(Дата, АптекаКод)
	
	МЗ = РегистрыСведений.SAS_ДатыДвиженийДляВыгрузки.СоздатьМенеджерЗаписи();
	МЗ.Дата = НачалоДня(Дата);
	МЗ.АптекаКод = АптекаКод;
	МЗ.Прочитать();
	МЗ.Дата = НачалоДня(Дата);
	МЗ.АптекаКод = АптекаКод;
	МЗ.ДатаЗаписи = ТекущаяДата();
	МЗ.Индекс = МЗ.Индекс + 1;
	МЗ.Записать(Истина);
	
	МЗ = РегистрыСведений.DWH_ДатыДвиженийДляВыгрузки.СоздатьМенеджерЗаписи();
	МЗ.Дата = НачалоДня(Дата);
	МЗ.АптекаКод = АптекаКод;
	МЗ.Прочитать();
	МЗ.Дата = НачалоДня(Дата);
	МЗ.АптекаКод = АптекаКод;
	МЗ.ДатаЗаписи = ТекущаяДата();
	МЗ.Индекс = МЗ.Индекс + 1;
	МЗ.Записать(Истина);
	
	
КонецПроцедуры

Процедура ЗафиксироватьДатуИзменений(Ссылка, Объект, РежимЗаписи) Экспорт
	
	ТипЗнчСсылка = ТипЗнч(Ссылка);
	
	Если ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ПоступлениеТовара") Тогда
		Если Объект.ЭтоНовый() и НЕ Объект.ДатаФактПоступления = Дата(1,1,1) Тогда //Если сразу новый документ проводят с факт. датой , то пишем в регистр
			Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
				ЗаписатьДатуИзменений(Объект.ДатаФактПоступления, Объект.Склад.Код);
				Возврат;
			КонецЕсли;
		Иначе //Если документ не новый тогда 
			Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись и (Объект.ДатаФактПоступления <> Дата(1,1,1) или Ссылка.ДатаФактПоступления <> Дата(1,1,1)) Тогда
				ЗаписатьДатуИзменений(Объект.ДатаФактПоступления, Объект.Склад.Код);
				Если (Ссылка.ДатаФактПоступления <> Объект.ДатаФактПоступления или  Ссылка.Склад <> Объект.Склад) и НЕ Ссылка.ДатаФактПоступления = Дата(1,1,1) Тогда
					ЗаписатьДатуИзменений(Ссылка.ДатаФактПоступления, Ссылка.Склад.Код);
				КонецЕсли;
				Возврат;
			КонецЕсли;			
		КонецЕсли;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВводОстатков") Тогда
		Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			ЗаписатьДатуИзменений(Объект.Дата, Объект.Склад.Код);	
			Если (Ссылка.Дата <> Объект.Дата или  Ссылка.Склад <> Объект.Склад) и НЕ Объект.ЭтоНовый() Тогда
				ЗаписатьДатуИзменений(Ссылка.Дата, Ссылка.Склад.Код);
			КонецЕсли;			
		КонецЕсли;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_РеализацияККМ") Тогда
		Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			ЗаписатьДатуИзменений(Объект.Дата, Объект.СкладКод);	
			Если (Ссылка.Дата <> Объект.Дата или  Ссылка.СкладКод <> Объект.СкладКод) и НЕ Объект.ЭтоНовый() Тогда
				ЗаписатьДатуИзменений(Ссылка.Дата, Ссылка.СкладКод);
			КонецЕсли;			
		КонецЕсли;
	ИначеЕсли	ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Списание") 
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВозвратТовара")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_АрбитражПомещение")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_АрбитражИзъятие")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВозвратОтПокупателя")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Торг2")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_КорректировкаНедовоза")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Разбраковка")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_МелкооптоваяРеализация")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Инвентаризация")
			или ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Трансформация") Тогда
			
		Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			ЗаписатьДатуИзменений(Объект.Дата, Объект.Склад.Код);	
			Если (Ссылка.Дата <> Объект.Дата или  Ссылка.Склад <> Объект.Склад) и НЕ Объект.ЭтоНовый() Тогда
				ЗаписатьДатуИзменений(Ссылка.Дата, Ссылка.Склад.Код);
			КонецЕсли;			
		КонецЕсли;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Перемещение") Тогда
		
		Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			//Пишем для отправителя
			Если НЕ Объект.ДатаФактическойОтгрузки = Дата(1,1,1) Тогда
				ЗаписатьДатуИзменений(Объект.ДатаФактическойОтгрузки, Объект.СкладОтправитель.Код);
			КонецЕсли;
			
			Если (Объект.ДатаФактическойОтгрузки <> Ссылка.ДатаФактическойОтгрузки или Объект.СкладОтправитель <> Ссылка.СкладОтправитель) и НЕ Ссылка.ДатаФактическойОтгрузки = Дата(1,1,1) и НЕ Объект.ЭтоНовый() Тогда
				ЗаписатьДатуИзменений(Ссылка.ДатаФактическойОтгрузки, Ссылка.СкладОтправитель.Код);	
			КонецЕсли;
			
			//Пишем для Получателя
			Если НЕ Объект.ДатаЗавоза = Дата(1,1,1) Тогда
				ЗаписатьДатуИзменений(Объект.ДатаЗавоза, Объект.СкладПолучатель.Код);
			КонецЕсли;
			
			Если (Объект.ДатаЗавоза <> Ссылка.ДатаЗавоза или Объект.СкладПолучатель <> Ссылка.СкладПолучатель) и НЕ Ссылка.ДатаЗавоза = Дата(1,1,1) и НЕ Объект.ЭтоНовый() Тогда
				ЗаписатьДатуИзменений(Ссылка.ДатаЗавоза, Ссылка.СкладПолучатель.Код);	
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура SAS_Обмен_ПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗафиксироватьДатуИзменений(Источник.Ссылка,Источник,РежимЗаписи);
	
КонецПроцедуры

Функция ПолучитьШапкуРасчетаПотребности(КодАптеки,Дата) Экспорт
	
	
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	Рез.Дата,
	                 |	Рез.КодАптеки,
	                 |	Рез.КоличествоКЗаказуSAS,
	                 |	Рез.СуммаЗаказаSAS
	                 |ИЗ
	                 |	РегистрСведений.SAS_ДатыРасчетаПотребности КАК Рез
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                 |			SAS_ДатыРасчетаПотребности.КодАптеки КАК КодАптеки,
	                 |			МАКСИМУМ(SAS_ДатыРасчетаПотребности.Дата) КАК Дата
	                 |		ИЗ
	                 |			РегистрСведений.SAS_ДатыРасчетаПотребности КАК SAS_ДатыРасчетаПотребности
	                 |		ГДЕ
	                 |			SAS_ДатыРасчетаПотребности.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                 |			И SAS_ДатыРасчетаПотребности.КодАптеки = &КодАптеки
	                 |		
	                 |		СГРУППИРОВАТЬ ПО
	                 |			SAS_ДатыРасчетаПотребности.КодАптеки) КАК Выборка
	                 |		ПО (Выборка.КодАптеки = Рез.КодАптеки)
	                 |			И (Выборка.Дата = Рез.Дата)
	                 |ГДЕ
	                 |	Рез.КодАптеки = &КодАптеки";
					 
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Дата));
	Запрос.УстановитьПараметр("КодАптеки",КодАптеки);

	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		ДанныеЗаписи = Новый Структура();
		ДанныеЗаписи.Вставить("КоличествоКЗаказуSAS",0);
		ДанныеЗаписи.Вставить("СуммаЗаказаSAS",0);
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		ДанныеЗаписи = Новый Структура();
		ДанныеЗаписи.Вставить("КоличествоКЗаказуSAS",Выборка.КоличествоКЗаказуSAS);
		ДанныеЗаписи.Вставить("СуммаЗаказаSAS",Выборка.СуммаЗаказаSAS);			
	КонецЕсли;
	
	Возврат ДанныеЗаписи;

	
	  //МенеджерЗаписи = РегистрыСведений.SAS_ДатыРасчетаПотребности.СоздатьМенеджерЗаписи();
	  //  МенеджерЗаписи.Дата    = Дата;
	  //  МенеджерЗаписи.КодАптеки  = КодАптеки;
	  //  МенеджерЗаписи.Прочитать();
	  //  Если МенеджерЗаписи.Выбран() Тогда
	  //  	ДанныеЗаписи = Новый Структура();
	  //  	ДанныеЗаписи.Вставить("КоличествоКЗаказуSAS",МенеджерЗаписи.КоличествоКЗаказуSAS);
	  //  	ДанныеЗаписи.Вставить("СуммаЗаказаSAS",МенеджерЗаписи.СуммаЗаказаSAS);
	  //  	
	  //  Иначе
	  //  	ДанныеЗаписи = Новый Структура();
	  //  	ДанныеЗаписи.Вставить("КоличествоКЗаказуSAS",0);
	  //  	ДанныеЗаписи.Вставить("СуммаЗаказаSAS",0);
	  //  КонецЕсли;  
		
			
	
КонецФункции
